# -*- coding: utf-8 -*-
#####################################################################################################################
#                                                                                                                   #
# Домашнее задание к уроку 1                                                                                        #
#                                                                                                                   #
# Задание №6                                                                                                        #
# По введенным пользователем длинам трех отрезков определить, можно-ли составить из этих отрезков треугольник.      #
# Если да, определить, будет-ли треугольник разносторонним, равнобедренным, или равносторонним.                     #
#                                                                                                                   #
# MIT License                                                                                                       #
# Copyright (c) 2020 Michael Nikitenko                                                                              #
#                                                                                                                   #
#####################################################################################################################


if __name__ == '__main__':
    print('Lesson 1 task 6')
